Revit 2027 API
FamilyParameterSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual FamilyParameterSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As FamilyParameterSetIterator
public:
virtual FamilyParameterSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> FamilyParameterSetIterator
override ForwardIterator : unit -> FamilyParameterSetIterator
Return Value
FamilyParameterSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
FamilyParameterSet Class
Autodesk.Revit.DB Namespace